#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Aug 29 12:54:32 2022

@author: john
"""

str_ = [
        
"""
詔 殉 儒 栽 肯 薫 擬 且 寡 亜
奨 循 囚 斎 侯 茎 糾 缶 稼 尉
彰 庶 臭 索 洪 渓 窮 陥 蚊 逸
償 緒 愁 酢 貢 蛍 拒 患 拐 姻
礁 叙 酬 桟 溝 慶 享 堪 懐 韻
浄 升 醜 傘 衡 傑 挟 棺 劾 畝
剰 抄 汁 肢 購 嫌 恭 款 涯 浦
壌 肖 充 嗣 拷 献 矯 閑 垣 疫
醸 尚 渋 賜 剛 謙 暁 寛 核 謁
津 宵 銃 璽 酷 繭 菌 憾 殻 猿
唇 症 叔 漆 昆 顕 琴 還 嚇 凹
娠 祥 淑 遮 懇 懸 謹 艦 括 翁
紳 渉 粛 蛇 唆 弦 襟 頑 喝 虞
診 訟 塾 酌 詐 呉 吟 飢 渇 渦
刃 硝 俊 爵 砕 碁 隅 宜 褐 禍
迅 粧 准 珠 宰 江 勲 偽 轄 靴
寮 悠 堀 憤 煩 尼 艇 挑 霜 践 甚
倫 猶 奔 丙 頒 妊 泥 眺 藻 遷 帥
累 裕 麻 併 妃 忍 迭 釣 妥 薦 睡
塁 融 摩 塀 披 寧 徹 懲 堕 繊 枢
戻 庸 磨 幣 扉 把 撤 勅 惰 禅 崇
鈴 窯 抹 弊 罷 覇 悼 朕 駄 漸 据
賄 羅 岬 偏 猫 廃 搭 塚 泰 租 杉
枠 酪 銘 遍 賓 培 棟 漬 濯 疎 斉
痢 妄 泡 頻 媒 筒 坪 但 塑 逝
履 盲 俸 瓶 賠 謄 呈 棚 壮 誓
柳 耗 褒 扶 伯 騰 廷 痴 荘 析
竜 厄 剖 附 舶 洞 邸 逐 捜 拙
硫 愉 紡 譜 漠 督 亭 秩 挿 窃
虜 諭 朴 侮 肌 凸 貞 嫡 曹 仙
涼 癒 僕 沸 鉢 屯 逓 衷 喪 栓
僚 唯 撲 雰 閥 軟 偵 弔 槽 旋
"""
        ]

piu = str_[0]

for s in str_:
    
    h = list(s)

    for k in h:
        
        
        if k != " " and k != "\n":
            
            print(k)